//--------------------------------------------------------------------
// (C) oil
// 2013-05-05
//--------------------------------------------------------------------
#ifndef _SoConsoleHelp_h_
#define _SoConsoleHelp_h_
//--------------------------------------------------------------------
class SoConsoleHelp
{
public:
	//等待并获取用户输入字符串。当用户输入回车键时，表示输入结束，本函数返回。
	//返回的字符串是包含结束符的，但是不包含用户最后输入的回车键字符。
	//本函数不是线程安全的，本函数使用了全局静态内存空间，在下一个“修改该
	//全局静态内存空间的”函数调用之前，你必须处理完本次调用。
	//--bShowTipsForHowToFinish 如果值为true，则函数内部会在屏幕上输出一句提示信息："(按下回车表示结束输入)"。
	static char* GetInputString(bool bShowTipsForHowToFinish);

	//禁用控制台窗口右上角的“关闭”按钮。
	static void DisableCloseButton();

	//截获CTRL+C等系统消息。
	static void SetMyConsoleCtrlHandler();
};
//--------------------------------------------------------------------
#endif //_SoConsoleHelp_h_
//--------------------------------------------------------------------
