//--------------------------------------------------------------------
// (C) oil
// 2013-05-05
//--------------------------------------------------------------------
#ifndef _SoSharedMemDefine_h_
#define _SoSharedMemDefine_h_
//--------------------------------------------------------------------
//共享内存的默认内存大小。
#define DefaultMemSize_SharedMem 1024000
//共享内存的内存最大值。
#define MaxMemSize_SharedMem 11024000
//Mutex的名字。
#define AppendMutexName_SharedMem "_Mutex"

//--------------------------------------------------------------------
#endif //_SoSharedMemDefine_h_
//--------------------------------------------------------------------
